Rahix/avr-device/vendor/atmega16U2.atdf
        <register caption="USB Endpoint Control Register" name="UECONX" offset="0xEB" size="1">
          <bitfield caption="STALL Request Handshake Bit" mask="0x20" name="STALLRQ"/>
          <bitfield caption="STALL Request Clear Handshake Bit" mask="0x10" name="STALLRQC"/>
          <bitfield caption="Reset Data Toggle Bit" mask="0x08" name="RSTDT"/>
          <bitfield caption="Endpoint Enable Bit" mask="0x01" name="EPEN"/>
        </register>
        <register caption="USB Endpoint Reset Register" name="UERST" offset="0xEA" size="1">
          <bitfield caption="Endpoint FIFO Reset Bits" mask="0x1F" name="EPRST"/>
        </register>
        <register caption="USB Endpoint Number" name="UENUM" offset="0xE9" size="1" mask="0x07">
          <bitfield caption="Endpoint Number bits" mask="0x07" name="EPNUM"/>
        </register>
        <register caption="USB Endpoint Interrupt Register" name="UEINTX" offset="0xE8" size="1">
          <bitfield caption="FIFO Control Bit" mask="0x80" name="FIFOCON"/>
          <bitfield caption="NAK IN Received Interrupt Flag" mask="0x40" name="NAKINI"/>
          <bitfield caption="Read/Write Allowed Flag" mask="0x20" name="RWAL"/>
          <bitfield caption="NAK OUT Received Interrupt Flag" mask="0x10" name="NAKOUTI"/>
          <bitfield caption="Received SETUP Interrupt Flag" mask="0x08" name="RXSTPI"/>
          <bitfield caption="Received OUT Data Interrupt Flag" mask="0x04" name="RXOUTI"/>
          <bitfield caption="STALLEDI Interrupt Flag" mask="0x02" name="STALLEDI"/>
          <bitfield caption="Transmitter Ready Interrupt Flag" mask="0x01" name="TXINI"/>
        </register>
        <register caption="USB Device Micro Frame Number" name="UDMFN" offset="0xE6" size="1" ocd-rw="R">
          <bitfield caption="Frame Number CRC Error Flag" mask="0x10" name="FNCERR"/>
        </register>
        <register caption="USB Device Frame Number High Register" name="UDFNUM" offset="0xE4" size="2" mask="0x07FF">
          <bitfield caption="Frame Number Upper Flag" mask="0x07FF" name="FNUM"/>
        </register>
        <register caption="USB Device Address Register" name="UDADDR" offset="0xE3" size="1">
          <bitfield caption="Address Enable Bit" mask="0x80" name="ADDEN"/>
          <bitfield caption="USB Address Bits" mask="0x7F" name="UADD"/>
        </register>
        <register caption="USB Device Interrupt Enable Register" name="UDIEN" offset="0xE2" size="1">
          <bitfield caption="Upstream Resume Interrupt Enable Bit" mask="0x40" name="UPRSME"/>
          <bitfield caption="End Of Resume Interrupt Enable Bit" mask="0x20" name="EORSME"/>
          <bitfield caption="Wake-up CPU Interrupt Enable Bit" mask="0x10" name="WAKEUPE"/>
          <bitfield caption="End Of Reset Interrupt Enable Bit" mask="0x08" name="EORSTE"/>
          <bitfield caption="Start Of Frame Interrupt Enable Bit" mask="0x04" name="SOFE"/>
          <bitfield caption="Suspend Interrupt Enable Bit" mask="0x01" name="SUSPE"/>
        </register>
        <register caption="USB Device Interrupt Register" name="UDINT" offset="0xE1" size="1">
          <bitfield caption="Upstream Resume Interrupt Flag" mask="0x40" name="UPRSMI"/>
          <bitfield caption="End Of Resume Interrupt Flag" mask="0x20" name="EORSMI"/>
          <bitfield caption="Wake-up CPU Interrupt Flag" mask="0x10" name="WAKEUPI"/>
          <bitfield caption="End Of Reset Interrupt Flag" mask="0x08" name="EORSTI"/>
          <bitfield caption="Start Of Frame Interrupt Flag" mask="0x04" name="SOFI"/>
          <bitfield caption="Suspend Interrupt Flag" mask="0x01" name="SUSPI"/>
        </register>
        <register caption="USB Device Control Registers" name="UDCON" offset="0xE0" size="1">
          <bitfield caption="USB Reset CPU Bit" mask="0x04" name="RSTCPU"/>
          <bitfield caption="Remote Wake-up Bit" mask="0x02" name="RMWKUP"/>
          <bitfield caption="Detach Bit" mask="0x01" name="DETACH"/>
        </register>
        <register caption="USB General Control Register" name="USBCON" offset="0xD8" size="1">
          <bitfield caption="USB macro Enable Bit" mask="0x80" name="USBE"/>
          <bitfield caption="Freeze USB Clock Bit" mask="0x20" name="FRZCLK"/>
        </register>
        <register caption="Regulator Control Register" name="REGCR" offset="0x63" size="1" ocd-rw="R">
          <bitfield caption="Regulator Disable" mask="0x01" name="REGDIS"/>
        </register>
      </register-group>
    </module>
    <module caption="CPU Registers" name="CPU">
      <register-group caption="CPU Registers" name="CPU">
        <register caption="Status Register" name="SREG" offset="0x5F" size="1">
          <bitfield caption="Global Interrupt Enable" mask="0x80" name="I"/>
          <bitfield caption="Bit Copy Storage" mask="0x40" name="T"/>
          <bitfield caption="Half Carry Flag" mask="0x20" name="H"/>
          <bitfield caption="Sign Bit" mask="0x10" name="S"/>
          <bitfield caption="Two's Complement Overflow Flag" mask="0x08" name="V"/>
          <bitfield caption="Negative Flag" mask="0x04" name="N"/>
          <bitfield caption="Zero Flag" mask="0x02" name="Z"/>
          <bitfield caption="Carry Flag" mask="0x01" name="C"/>
        </register>
        <register caption="Stack Pointer " name="SP" offset="0x5D" size="2" mask="0xFFFF"/>
        <register caption="MCU Control Register" name="MCUCR" offset="0x55" size="1">
          <bitfield caption="Pull-up disable" mask="0x10" name="PUD"/>
          <bitfield caption="Interrupt Vector Select" mask="0x02" name="IVSEL"/>
          <bitfield caption="Interrupt Vector Change Enable" mask="0x01" name="IVCE"/>
        </register>
        <register caption="MCU Status Register" name="MCUSR" offset="0x54" size="1">
          <bitfield caption="USB reset flag" mask="0x20" name="USBRF"/>
          <bitfield caption="Watchdog Reset Flag" mask="0x08" name="WDRF"/>
          <bitfield caption="Brown-out Reset Flag" mask="0x04" name="BORF"/>
          <bitfield caption="External Reset Flag" mask="0x02" name="EXTRF"/>
          <bitfield caption="Power-on reset flag" mask="0x01" name="PORF"/>
        </register>
        <register caption="Oscillator Calibration Value" name="OSCCAL" offset="0x66" size="1" mask="0xFF" ocd-rw="R">
          <bitfield caption="Oscillator Calibration " mask="0xFF" name="OSCCAL"/>
        </register>
        <register caption="" name="CLKPR" offset="0x61" size="1" ocd-rw="R">
          <bitfield caption="" mask="0x80" name="CLKPCE"/>
          <bitfield caption="" mask="0x0F" name="CLKPS"/>
        </register>
        <register caption="Sleep Mode Control Register" name="SMCR" offset="0x53" size="1">
          <bitfield caption="Sleep Mode Select bits" mask="0x0E" name="SM" values="CPU_SLEEP_MODE_3BITS"/>
          <bitfield caption="Sleep Enable" mask="0x01" name="SE"/>
        </register>
        <register caption="Extended Indirect Register" name="EIND" offset="0x5C" size="1" mask="0x01"/>
