Rahix/avr-device/vendor/atmega16U2.atdf
        <register caption="USART Control and Status Register C" name="UCSR1C" offset="0xCA" size="1">
          <bitfield caption="USART Mode Select" mask="0xC0" name="UMSEL1"/>
          <bitfield caption="Parity Mode Bits" mask="0x30" name="UPM1"/>
          <bitfield caption="Stop Bit Select" mask="0x08" name="USBS1"/>
          <bitfield caption="Character Size" mask="0x06" name="UCSZ1"/>
          <bitfield caption="Clock Polarity" mask="0x01" name="UCPOL1"/>
        </register>
        <register caption="USART Control and Status Register D" name="UCSR1D" offset="0xCB" size="1">
          <bitfield caption="CTS Enable" mask="0x02" name="CTSEN"/>
          <bitfield caption="RTS Enable" mask="0x01" name="RTSEN"/>
        </register>
        <register caption="USART Baud Rate Register Bytes" name="UBRR1" offset="0xCC" size="2" mask="0x0FFF">
          <bitfield caption="USART Baud Rate bits" mask="0x0FFF" name="UBRR1"/>
        </register>
      </register-group>
    </module>
    <module caption="Watchdog Timer" name="WDT">
      <register-group caption="Watchdog Timer" name="WDT">
        <register caption="Watchdog Timer Control Register" name="WDTCSR" offset="0x60" size="1" ocd-rw="R">
          <bitfield caption="Watchdog Timeout Interrupt Flag" mask="0x80" name="WDIF"/>
          <bitfield caption="Watchdog Timeout Interrupt Enable" mask="0x40" name="WDIE"/>
          <bitfield caption="Watchdog Timer Prescaler Bits" mask="0x27" name="WDP"/>
          <bitfield caption="Watchdog Change Enable" mask="0x10" name="WDCE"/>
          <bitfield caption="Watch Dog Enable" mask="0x08" name="WDE"/>
        </register>
        <register caption="Watchdog Timer Clock Divider" name="WDTCKD" offset="0x62" size="1">
          <bitfield caption="Watchdog Early Warning Interrupt Flag" mask="0x08" name="WDEWIF"/>
          <bitfield caption="Watchdog Early Warning Interrupt Enable" mask="0x04" name="WDEWIE"/>
          <bitfield caption="Watchdog Timer Clock Dividers" mask="0x03" name="WCLKD"/>
        </register>
      </register-group>
    </module>
    <module caption="Analog Comparator" name="AC">
      <register-group caption="Analog Comparator" name="AC">
        <register caption="Analog Comparator Control And Status Register" name="ACSR" offset="0x50" size="1" ocd-rw="R">
          <bitfield caption="Analog Comparator Disable" mask="0x80" name="ACD"/>
          <bitfield caption="Analog Comparator Bandgap Select" mask="0x40" name="ACBG"/>
          <bitfield caption="Analog Compare Output" mask="0x20" name="ACO"/>
          <bitfield caption="Analog Comparator Interrupt Flag" mask="0x10" name="ACI"/>
          <bitfield caption="Analog Comparator Interrupt Enable" mask="0x08" name="ACIE"/>
          <bitfield caption="Analog Comparator Input Capture Enable" mask="0x04" name="ACIC"/>
          <bitfield caption="Analog Comparator Interrupt Mode Select bits" mask="0x03" name="ACIS" values="ANALOG_COMP_INTERRUPT"/>
        </register>
        <register caption="Analog Comparator Input Multiplexer" name="ACMUX" offset="0x7D" size="1">
          <bitfield caption="Analog Comparator Selection Bits" mask="0x07" name="CMUX" values="ANALOG_COMP_SELECTION_BITS"/>
        </register>
        <register caption="" name="DIDR1" offset="0x7F" size="1" ocd-rw="W">
          <bitfield caption="AIN7 Digital Input Disable" mask="0x80" name="AIN7D"/>
          <bitfield caption="AIN6 Digital Input Disable" mask="0x40" name="AIN6D"/>
          <bitfield caption="AIN5 Digital Input Disable" mask="0x20" name="AIN5D"/>
          <bitfield caption="AIN4 Digital Input Disable" mask="0x10" name="AIN4D"/>
          <bitfield caption="AIN3 Digital Input Disable" mask="0x08" name="AIN3D"/>
          <bitfield caption="AIN2 Digital Input Disable" mask="0x04" name="AIN2D"/>
          <bitfield caption="AIN1 Digital Input Disable" mask="0x02" name="AIN1D"/>
          <bitfield caption="AIN0 Digital Input Disable" mask="0x01" name="AIN0D"/>
        </register>
      </register-group>
      <value-group caption="" name="ANALOG_COMP_INTERRUPT">
        <value caption="Interrupt on Toggle" name="VAL_0x00" value="0x00"/>
        <value caption="Reserved" name="VAL_0x01" value="0x01"/>
        <value caption="Interrupt on Falling Edge" name="VAL_0x02" value="0x02"/>
        <value caption="Interrupt on Rising Edge" name="VAL_0x03" value="0x03"/>
      </value-group>
      <value-group caption="" name="ANALOG_COMP_SELECTION_BITS">
        <value caption="AIN1" name="AIN1" value="0x00"/>
        <value caption="AIN2" name="AIN2" value="0x01"/>
        <value caption="AIN3" name="AIN3" value="0x02"/>
        <value caption="AIN4" name="AIN4" value="0x03"/>
        <value caption="AIN5" name="AIN5" value="0x04"/>
        <value caption="AIN6" name="AIN6" value="0x05"/>
      </value-group>
    </module>
  </modules>
  <pinouts>
    <pinout name="QUAD">
      <pin pad="XTAL1" position="1"/>
      <pin pad="PC0" position="2"/>
      <pin pad="GND" position="3"/>
      <pin pad="VCC" position="4"/>
      <pin pad="PC2" position="5"/>
      <pin pad="PD0" position="6"/>
      <pin pad="PD1" position="7"/>
      <pin pad="PD2" position="8"/>
      <pin pad="PD3" position="9"/>
      <pin pad="PD4" position="10"/>
      <pin pad="PD5" position="11"/>
      <pin pad="PD6" position="12"/>
      <pin pad="PD7" position="13"/>
      <pin pad="PB0" position="14"/>
      <pin pad="PB1" position="15"/>
      <pin pad="PB2" position="16"/>
      <pin pad="PB3" position="17"/>
      <pin pad="PB4" position="18"/>
      <pin pad="PB5" position="19"/>
      <pin pad="PB6" position="20"/>
      <pin pad="PB7" position="21"/>
      <pin pad="PC7" position="22"/>
      <pin pad="PC6" position="23"/>
      <pin pad="PC1" position="24"/>
      <pin pad="PC5" position="25"/>
      <pin pad="PC4" position="26"/>
      <pin pad="UCAP" position="27"/>
      <pin pad="UGND" position="28"/>
      <pin pad="D+" position="29"/>
      <pin pad="D-" position="30"/>
      <pin pad="UVCC" position="31"/>
      <pin pad="AVCC" position="32"/>
    </pinout>
  </pinouts>
</avr-tools-device-file>